---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarContainerItem.GetDistributionPath
source: html/0a43e43f-fc15-d257-b159-dc76aedc2743.htm
---
# Autodesk.Revit.DB.Structure.RebarContainerItem.GetDistributionPath Method

The distribution path of a rebar set.

## Syntax (C#)
```csharp
public Line GetDistributionPath()
```

## Returns
A line beginning at (0, 0, 0) and representing the direction and
 length of the set.